import { Section, Img, Container, Text, Title } from './AboutUs.styled';

const AboutUs = () => {
  return (
    <Section>
      <Img
        src={'https://res.cloudinary.com/dpvqbbgkd/image/upload/v1777450590/MNVK/about/aboutUS_xto8fj.jpg'}
        alt="Mr.hero"
      />

      <Container>
        <Title>Про нас</Title>
        <Text>
          Це навчально-виховний комплекс, створений відповідно до Конституції України, Законів України «Про освіту»,
          «Про професійно-технічну освіту», «Про загальну середню освіту», Положення про міжшкільний
          навчально-виробничий комбінат, та інших нормативно-правових актів з питань освіти.
        </Text>
        <Text>
          МНВК – це перша сходинка до дорослого самостійного життя та вибору професії. КУ «Міський міжшкільний
          навчально-виробничий комбінат» СМР – це навчальний заклад, який забезпечує потреби учнів загальноосвітніх шкіл
          міста Суми у допрофесіях.
        </Text>
      </Container>
    </Section>
  );
};

export default AboutUs;
